app/views/home/dashboard.html.erb

      <span class="field">Total Tariff Cells</span>
      <span class="data"><%= Tariff.all.count - 1 %></span>
---
SELECT COUNT(*) FROM "tariffs"

      <span class="field">Total Risks</span>
      <span class="data"><%= Risk.all.count - 1 %></span>
---
SELECT COUNT(*) FROM "risks"

      <span class="field">Number of Competitors</span>
      <span class="data"><%= Product.uniq.pluck(:insurer).count %></span>
---
SELECT DISTINCT "products"."insurer" FROM "products"