app/views/tariffs/_steps.html.erb

SELECT COUNT(*) FROM "tariffs"
---

    <% if Tariff.all.empty? %>