app/views/tariffs/custom.html.erb

SELECT  "tariffs".* FROM "tariffs"  ORDER BY "tariffs"."id" ASC LIMIT 1
---

    <% Tariff.first.properties.each do |k,v| %>