app/views/tariffs/index.html.erb

        <tr>
        <%- unless Tariff.all.empty? %>
---
SELECT  "tariffs".* FROM "tariffs"  ORDER BY "tariffs"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tariffs"