app/views/tariffs/show.html.erb

<% if Tariff.all.empty? %>
---
SELECT  "tariffs".* FROM "tariffs"  ORDER BY "tariffs"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tariffs"