app/views/risks/index.html.erb

SELECT  "risks".* FROM "risks"  ORDER BY "risks"."id" ASC LIMIT 1
---
        <% if header == "covariates" %>
          <% Risk.first.covariates.each do |k,v| %>