app/controllers/codings_controller.rb

SELECT "tariffs".* FROM "tariffs" WHERE (properties ?& array['Sinistros nos últimos 5 anos'])
---
  def index
    @tariffs = Tariff.all