app/controllers/insurers_controller.rb

  def edit
    @insurer = Insurer.find_by_id(1)
---
SELECT  "insurers".* FROM "insurers" WHERE "insurers"."id" = $1 LIMIT 1  [["id", 1]]

  def billing
    @tariff = Tariff.find(1)
---
SELECT  "tariffs".* FROM "tariffs" WHERE "tariffs"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @insurer = Insurer.new(insurer_params)

    respond_to do |format|
      if @insurer.save
---
INSERT INTO "insurers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-10-23 09:23:55.127940"], ["updated_at", "2015-10-23 09:23:55.127940"]]

    def set_insurer
      @insurer = Insurer.find(params[:id])
---
SELECT  "insurers".* FROM "insurers" WHERE "insurers"."id" = $1 LIMIT 1  [["id", 1]]