app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
	def grid
		@products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		product = Product.find_by_id(params[:id])

SELECT "products".* FROM "products" WHERE (tariff_id = 2)
---
		def set_product
			@product = Product.find(params[:id])