app/controllers/risks_controller.rb

  def index
    @risks = Risk.all
---
SELECT  "risks".* FROM "risks"  ORDER BY "risks"."id" ASC LIMIT 1