app/controllers/tariffs_controller.rb

SELECT  "tariffs".* FROM "tariffs"  ORDER BY "tariffs"."id" ASC LIMIT 1
---
  def index
    @tariffs = Tariff.all

SELECT  "tariffs".* FROM "tariffs" WHERE "tariffs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @header = Tariff.column_names
    @tariff = Tariff.find(params[:id])

INSERT INTO "tariffs" ("premium", "insurer_id", "properties", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "risks" ("tariff_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tariff_id", 3], ["created_at", "2015-10-24 18:44:42.630556"], ["updated_at", "2015-10-24 18:44:42.630556"]]
SELECT  "risks".* FROM "risks" WHERE "risks"."tariff_id" = $1 LIMIT 1  [["tariff_id", 1]]
SELECT  "tariffs".* FROM "tariffs" WHERE (properties ?| array['Categoria'])  ORDER BY "tariffs"."id" ASC LIMIT 1
INSERT INTO "products" ("tariff_id", "premium", "insurer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tariff_id", 3], ["premium", 0.0], ["insurer", "test"], ["created_at", "2015-10-24 18:44:42.745416"], ["updated_at", "2015-10-24 18:44:42.745416"]]
SELECT  "insurers".* FROM "insurers" WHERE "insurers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."tariff_id" = $1 AND "products"."insurer" = $2 AND "products"."premium" = 0.0 LIMIT 1  [["tariff_id", 3], ["insurer", "test"]]
---
  def import
    @filters = params[:properties]
    @name = params[:file]

    directory = "tmp/tariffs"
    path = File.join(directory, @name)

    file = File.new(path, "r")

    spreadsheet = open_spreadsheet(file)
    @header = spreadsheet.sheet(0).row(1)



    (2..spreadsheet.last_row).each do |i|
      row = Hash[[@header, spreadsheet.row(i)].transpose].except!("Premio comercial")
      premium = row["Premio comercial"].to_f

      hash = {}
      @filters.each { |f| hash[f] = row[f] }

      tariff = Tariff.create!(:properties => hash, :premium => premium, :insurer_id => 1)

      Risk.find_or_create_by(tariff_id: tariff.id)
      Product.find_or_create_by(tariff_id: tariff.id, premium: premium, :insurer => tariff.insurer.name)