app/controllers/users_controller.rb

  def index
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    # Generate random base64 password
    @user.password = @user.password_confirmation =  SecureRandom.base64(8)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find_by_id(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "picture" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["picture", "244022_453843831334968_104157054_o.jpg"], ["updated_at", "2015-10-18 11:49:24.385185"], ["id", 1]]

  def destroy_multiple

    params[:users_ids].each do |id|
      User.find(id.to_i).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 19]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 19]]